### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_task_definition.default[0] has changed
  ~ resource "aws_ecs_task_definition" "default" {
        id                       = "gost-staging-api"
+       tags                     = {}
        # (13 unchanged attributes hidden)

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id          = "fs-08f95063c1cdbe191"
+               root_directory          = "/"
+               transit_encryption      = "ENABLED"
+               transit_encryption_port = 0

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }
-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id     = "fs-08f95063c1cdbe191" -> null
-               root_directory     = "/" -> null
-               transit_encryption = "ENABLED" -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role.execution[0] has changed
  ~ resource "aws_iam_role" "execution" {
        id                    = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
        name                  = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-06-27T13:19:51Z" -> "2023-07-12T17:07:28Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_iam_role.task[0] has changed
  ~ resource "aws_iam_role" "task" {
        id                    = "gost-staging-api-ECSTask-2023021701041477300000000a"
        name                  = "gost-staging-api-ECSTask-2023021701041477300000000a"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-06-27T12:39:52Z" -> "2023-07-12T15:11:39Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.module.grants_scraper.aws_iam_role.default[0] has changed
  ~ resource "aws_iam_role" "default" {
        id                    = "gost-staging-grants_scraper-2023021701041523320000000b"
        name                  = "gost-staging-grants_scraper-2023021701041523320000000b"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-06-27T06:14:24Z" -> "2023-07-12T06:14:24Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:14" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ network_configuration {
          ~ security_groups  = [
-               "sg-083ce3fb8d4e66859",
-               "sg-09b90196ed40630de",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "9d430062fcd8202322a1c95dce7a25544d206857" -> "416f2fce2b3052a15db1de300be3edd217dd44bc"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (4 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "9d430062fcd8202322a1c95dce7a25544d206857" -> "416f2fce2b3052a15db1de300be3edd217dd44bc"
                        },
                        {
                            name  = "ENABLE_GRANTS_DIGEST"
                            value = "false"
                        },
                        # (8 unchanged elements hidden)
                    ]
                    name                   = "api"
-                   volumesFrom            = [] -> null
                    # (9 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "9d430062fcd8202322a1c95dce7a25544d206857" -> "416f2fce2b3052a15db1de300be3edd217dd44bc"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (2 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "9d430062fcd8202322a1c95dce7a25544d206857" -> "416f2fce2b3052a15db1de300be3edd217dd44bc"
                        },
                        {
                            name  = "ECS_FARGATE"
                            value = "true"
                        },
                    ]
-                   mountPoints            = [] -> null
                    name                   = "datadog"
-                   portMappings           = [] -> null
-                   volumesFrom            = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "gost-staging-api" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.consume_grants.aws_appautoscaling_policy.sqs_scale_down_ecs_tasks will be created
+   resource "aws_appautoscaling_policy" "sqs_scale_down_ecs_tasks" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-staging-consume_grants-sqs-scale_down"
+       policy_type        = "StepScaling"
+       resource_id        = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ExactCapacity"
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_upper_bound = "0"
+               scaling_adjustment          = 0
            }
        }
    }

  # module.consume_grants.aws_appautoscaling_policy.sqs_scale_up_ecs_tasks will be created
+   resource "aws_appautoscaling_policy" "sqs_scale_up_ecs_tasks" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "gost-staging-consume_grants-sqs-scale_up"
+       policy_type        = "StepScaling"
+       resource_id        = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       step_scaling_policy_configuration {
+           adjustment_type         = "ExactCapacity"
+           cooldown                = 180
+           metric_aggregation_type = "Average"

+           step_adjustment {
+               metric_interval_lower_bound = "0"
+               metric_interval_upper_bound = "100"
+               scaling_adjustment          = 1
            }
+           step_adjustment {
+               metric_interval_lower_bound = "100"
+               metric_interval_upper_bound = "500"
+               scaling_adjustment          = 2
            }
+           step_adjustment {
+               metric_interval_lower_bound = "1000"
+               scaling_adjustment          = 4
            }
+           step_adjustment {
+               metric_interval_lower_bound = "500"
+               metric_interval_upper_bound = "1000"
+               scaling_adjustment          = 3
            }
        }
    }

  # module.consume_grants.aws_appautoscaling_target.desired_count will be created
+   resource "aws_appautoscaling_target" "desired_count" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 4
+       min_capacity       = 0
+       resource_id        = "service/gost-staging/gost-staging-consume_grants"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
    }

  # module.consume_grants.aws_cloudwatch_event_rule.grants_ingest-grant_modifications will be created
+   resource "aws_cloudwatch_event_rule" "grants_ingest-grant_modifications" {
+       arn            = (known after apply)
+       description    = "Captures grant created/updated events published by the grants-ingest service."
+       event_bus_name = "default"
+       event_pattern  = jsonencode(
            {
+               detail-type = [
+                   "GrantModificationEvent",
                ]
+               source      = [
+                   "org.usdigitalresponse.grants-ingest",
                ]
            }
        )
+       id             = (known after apply)
+       is_enabled     = true
+       name           = "gost-grants_ingest-grant_modifications"
+       name_prefix    = (known after apply)
+       tags_all       = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
    }

  # module.consume_grants.aws_cloudwatch_event_target.sqs will be created
+   resource "aws_cloudwatch_event_target" "sqs" {
+       arn            = (known after apply)
+       event_bus_name = "default"
+       id             = (known after apply)
+       rule           = "gost-grants_ingest-grant_modifications"
+       target_id      = (known after apply)
    }

  # module.consume_grants.aws_cloudwatch_log_group.default will be created
+   resource "aws_cloudwatch_log_group" "default" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = (known after apply)
+       name_prefix       = "gost-staging-consume_grants-"
+       retention_in_days = 30
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
    }

  # module.consume_grants.aws_cloudwatch_metric_alarm.sqs-scale_down_tasks will be created
+   resource "aws_cloudwatch_metric_alarm" "sqs-scale_down_tasks" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_description                     = "Decreases tasks consuming grant modifications based on source queue size."
+       alarm_name                            = "gost-staging-consume_grants-SQS-ScaleDown-Tasks"
+       arn                                   = (known after apply)
+       comparison_operator                   = "LessThanThreshold"
+       dimensions                            = (known after apply)
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "ApproximateNumberOfMessagesVisible"
+       namespace                             = "AWS/SQS"
+       period                                = 60
+       statistic                             = "Sum"
+       tags_all                              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       threshold                             = 1
+       treat_missing_data                    = "missing"
    }

  # module.consume_grants.aws_cloudwatch_metric_alarm.sqs_scale_up_ecs_tasks will be created
+   resource "aws_cloudwatch_metric_alarm" "sqs_scale_up_ecs_tasks" {
+       actions_enabled                       = true
+       alarm_actions                         = (known after apply)
+       alarm_description                     = "Increases tasks consuming grant modifications based on source queue size."
+       alarm_name                            = "gost-staging-consume_grants-SQS-ScaleUp-Tasks"
+       arn                                   = (known after apply)
+       comparison_operator                   = "GreaterThanOrEqualToThreshold"
+       dimensions                            = (known after apply)
+       evaluate_low_sample_count_percentiles = (known after apply)
+       evaluation_periods                    = 1
+       id                                    = (known after apply)
+       metric_name                           = "ApproximateNumberOfMessagesVisible"
+       namespace                             = "AWS/SQS"
+       period                                = 60
+       statistic                             = "Sum"
+       tags_all                              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       threshold                             = 1
+       treat_missing_data                    = "missing"
    }

  # module.consume_grants.aws_ecs_service.default will be created
+   resource "aws_ecs_service" "default" {
+       cluster                            = "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 0
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "gost-staging-consume_grants"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = [
+               "sg-09b90196ed40630de",
            ]
+           subnets          = (sensitive value)
        }
    }

  # module.consume_grants.aws_ecs_task_definition.consume_grants will be created
+   resource "aws_ecs_task_definition" "consume_grants" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (sensitive value)
+       cpu                      = "256"
+       execution_role_arn       = (known after apply)
+       family                   = "gost-staging-consume_grants"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_role_arn            = (known after apply)

+       runtime_platform {
+           cpu_architecture        = "ARM64"
+           operating_system_family = "LINUX"
        }
    }

  # module.consume_grants.aws_iam_role.execution will be created
+   resource "aws_iam_role" "execution" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-staging-consume_grants-ECS-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       role_last_used        = (known after apply)
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.consume_grants.aws_iam_role.task will be created
+   resource "aws_iam_role" "task" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Condition = {
+                           ArnLike      = {
+                               "aws:SourceArn" = "arn:aws:ecs:us-west-2:357150818708:*"
                            }
+                           StringEquals = {
+                               "aws:SourceAccount" = "357150818708"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "gost-staging-consume_grants-ECSTask-"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       role_last_used        = (known after apply)
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.consume_grants.aws_iam_role_policy.execution["decrypt-datadog-api-key"] will be created
+   resource "aws_iam_role_policy" "execution" {
+       id     = (known after apply)
+       name   = "decrypt-datadog-api-key"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "kms:Decrypt"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key",
+                           "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb",
                        ]
+                       Sid      = "DecryptWithKMS"
                    },
+                   {
+                       Action   = [
+                           "ssm:GetParameters",
+                           "secretsmanager:GetSecretValue",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
+                       Sid      = "GetSecretParameters"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.consume_grants.aws_iam_role_policy.execution["write-logs"] will be created
+   resource "aws_iam_role_policy" "execution" {
+       id     = (known after apply)
+       name   = "write-logs"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.consume_grants.aws_iam_role_policy.task["connect-to-postgres"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "connect-to-postgres"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "rds-db:connect"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:rds-db:us-west-2:357150818708:dbuser:cluster-MB5CSR4GERRMATFYFNW7H6HPWY/postgres"
+                       Sid      = "DBAccess"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.consume_grants.aws_iam_role_policy.task["consume-sqs-messages"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "consume-sqs-messages"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.consume_grants.aws_iam_role_policy.task["ecs-exec"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "ecs-exec"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ssmmessages:OpenDataChannel",
+                           "ssmmessages:OpenControlChannel",
+                           "ssmmessages:CreateDataChannel",
+                           "ssmmessages:CreateControlChannel",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AllowExec"
                    },
+                   {
+                       Action   = "logs:DescribeLogGroups"
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "InventoryLogGroupsForExec"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

  # module.consume_grants.aws_iam_role_policy.task["write-logs"] will be created
+   resource "aws_iam_role_policy" "task" {
+       id     = (known after apply)
+       name   = "write-logs"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.consume_grants_to_postgres_security_group.aws_security_group.cbd[0] will be created
+   resource "aws_security_group" "cbd" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Attributes" = "consumegrants-postgres"
+           "Name"       = "gost-staging-consumegrants-postgres"
+           "Namespace"  = "gost-staging"
        }
+       tags_all               = {
+           "Attributes" = "consumegrants-postgres"
+           "Name"       = "gost-staging-consumegrants-postgres"
+           "Namespace"  = "gost-staging"
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       vpc_id                 = (sensitive value)

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.consume_grants_to_postgres_security_group.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
+   resource "aws_security_group_rule" "keyed" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       ipv6_cidr_blocks         = [
+           "::/0",
        ]
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.consume_grants_to_postgres_security_group.null_resource.sync_rules_and_sg_lifecycles[0] will be created
+   resource "null_resource" "sync_rules_and_sg_lifecycles" {
+       id       = (known after apply)
+       triggers = {
+           "sg_ids" = (known after apply)
        }
    }

  # module.consume_grants_to_postgres_security_group.random_id.rule_change_forces_new_security_group[0] will be created
+   resource "random_id" "rule_change_forces_new_security_group" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 3
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
+       keepers     = {
+           "rules" = jsonencode(
                {
+                   _allow_all_egress_ = {
+                       cidr_blocks              = [
+                           "0.0.0.0/0",
                        ]
+                       description              = "Allow all egress"
+                       from_port                = 0
+                       ipv6_cidr_blocks         = [
+                           "::/0",
                        ]
+                       key                      = "_allow_all_egress_"
+                       prefix_list_ids          = []
+                       protocol                 = "-1"
+                       security_groups          = []
+                       self                     = null
+                       source_security_group_id = null
+                       to_port                  = 0
+                       type                     = "egress"
                    }
                }
            )
        }
    }

  # module.api.module.grants_scraper.data.aws_iam_policy_document.permissions[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "permissions" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "ecs:RunTask",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowRunTask"

+           condition {
+               test     = "ArnLike"
+               values   = [
+                   "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging",
                ]
+               variable = "ecs:cluster"
            }
        }
+       statement {
+           actions   = [
+               "iam:PassRole",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:iam::357150818708:role/gost-staging-api-ECSTask-2023021701041477300000000a",
+               "arn:aws:iam::357150818708:role/gost-staging-api-ECSTaskExecution-20230217010414321500000009",
            ]
+           sid       = "AllowSchedulerPassRoleToExecutionRole"
        }
    }

  # module.api.module.grants_scraper.aws_iam_role_policy.default[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "default" {
        id     = "gost-staging-grants_scraper-2023021701041523320000000b:terraform-20230217010528091000000012"
        name   = "terraform-20230217010528091000000012"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "ecs:RunTask"
-                       Condition = {
-                           ArnLike = {
-                               "ecs:cluster" = "arn:aws:ecs:us-west-2:357150818708:cluster/gost-staging"
                            }
                        }
-                       Effect    = "Allow"
-                       Resource  = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:*"
-                       Sid       = "AllowRunTask"
                    },
-                   {
-                       Action   = "iam:PassRole"
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:iam::357150818708:role/gost-staging-api-ECSTaskExecution-20230217010414321500000009",
-                           "arn:aws:iam::357150818708:role/gost-staging-api-ECSTask-2023021701041477300000000a",
                        ]
-                       Sid      = "AllowSchedulerPassRoleToExecutionRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.module.grants_scraper.aws_scheduler_schedule.default[0] will be updated in-place
  ~ resource "aws_scheduler_schedule" "default" {
        id                           = "default/gost-staging-grants_scraper-20230217010528095600000013"
        name                         = "gost-staging-grants_scraper-20230217010528095600000013"
        # (10 unchanged attributes hidden)

      ~ target {
            # (3 unchanged attributes hidden)

          ~ ecs_parameters {
                tags                    = {}
              ~ task_definition_arn     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:14" -> (known after apply)
                # (8 unchanged attributes hidden)

              ~ network_configuration {
                  ~ security_groups  = [
-                       "sg-09b90196ed40630de",
                    ] -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.consume_grants.module.consume_sqs_messages_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:ReceiveMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowConsumeMessages"
        }
+       statement {
+           actions   = [
+               "sqs:GetQueueAttributes",
+               "sqs:GetQueueUrl",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowReadMetadata"
        }
    }

  # module.consume_grants.module.sqs_queue.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "sqs:SendMessage",
+               "sqs:SendMessageBatch",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
+           sid       = "AllowPublishFromEventBridgeRule"

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           principals {
+               identifiers = [
+                   "events.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.consume_grants.module.sqs_queue.aws_sqs_queue.dlq[0] will be created
+   resource "aws_sqs_queue" "dlq" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 604800
+       name                              = (known after apply)
+       name_prefix                       = "gost-staging-grants-ingest_events-dlq-"
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 20
+       redrive_allow_policy              = (known after apply)
+       redrive_policy                    = (known after apply)
+       sqs_managed_sse_enabled           = true
+       tags_all                          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 900
    }

  # module.consume_grants.module.sqs_queue.aws_sqs_queue.this[0] will be created
+   resource "aws_sqs_queue" "this" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 172800
+       name                              = (known after apply)
+       name_prefix                       = "gost-staging-grants-ingest_events-"
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 20
+       redrive_allow_policy              = (known after apply)
+       redrive_policy                    = (known after apply)
+       sqs_managed_sse_enabled           = true
+       tags_all                          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 900
    }

  # module.consume_grants.module.sqs_queue.aws_sqs_queue_policy.this[0] will be created
+   resource "aws_sqs_queue_policy" "this" {
+       id        = (known after apply)
+       policy    = (known after apply)
+       queue_url = (known after apply)
    }

  # module.consume_grants.module.sqs_queue.aws_sqs_queue_redrive_allow_policy.dlq[0] will be created
+   resource "aws_sqs_queue_redrive_allow_policy" "dlq" {
+       id                   = (known after apply)
+       queue_url            = (known after apply)
+       redrive_allow_policy = (known after apply)
    }

  # module.consume_grants.module.sqs_queue.aws_sqs_queue_redrive_policy.dlq[0] will be created
+   resource "aws_sqs_queue_redrive_policy" "dlq" {
+       id             = (known after apply)
+       queue_url      = (known after apply)
+       redrive_policy = (known after apply)
    }

  # module.consume_grants.module.write_logs_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "logs:CreateLogStream",
+               "logs:DescribeLogStreams",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "WriteLogs"
        }
    }

  # module.postgres.module.db.aws_security_group_rule.this["from_consume_grants"] will be created
+   resource "aws_security_group_rule" "this" {
+       from_port                = 5432
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = "sg-0b1895f711684bb06"
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 5432
+       type                     = "ingress"
    }

  # module.api.module.efs_data_volume.module.security_group.aws_security_group_rule.keyed["_m[0]#in#sg#0"] must be replaced
+/- resource "aws_security_group_rule" "keyed" {
      ~ id                       = "sgrule-3871657061" -> (known after apply)
      ~ security_group_rule_id   = "sgr-070399adf958c63f9" -> (known after apply)
      ~ source_security_group_id = "sg-09b90196ed40630de" -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)
    }

Plan: 30 to add, 3 to change, 2 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: `Terraform CI`*